{
  "moduleId": "alcohol_drugs",
  "moduleName": "Alcohol and Drugs",
  "icon": "exclamationmark.triangle.fill",
  "color": "#DC2626",
  "lessons": [
    {
      "lessonNumber": 1,
      "title": "BAC Limits & Zero Tolerance",
      "icon": "drop.triangle.fill",
      "overview": "Think 'just one drink' won't matter? Think again. California has strict BAC limits, and for drivers under 21, it's zero tolerance - literally any detectable alcohol = license gone for a year.",
      "keyPoints": [
        "BAC measures alcohol percentage in your blood (0.08% = 0.08 grams alcohol per 100ml blood)",
        "Legal limits: 0.08% (21+), 0.01% (under 21), 0.04% (commercial drivers)",
        "Under 21: BAC of 0.01% = automatic 1-year license suspension",
        "Factors affecting BAC: amount consumed, body weight, food, time, strength of alcohol",
        "Your liver metabolizes only ~1 ounce of alcohol per hour - you can't speed this up"
      ],
      "detailedContent": "Blood Alcohol Concentration (BAC) measures the percentage of alcohol in your bloodstream. If your BAC is 0.08%, that means your blood is 0.08% alcohol (0.08 grams of alcohol per 100 milliliters of blood). California's BAC limits are strict: 0.08% or higher for adults 21+, 0.01% or higher for anyone under 21, 0.01% for drivers on DUI probation, and 0.04% for commercial drivers or passenger-for-hire drivers. Even if your BAC is below the legal limit, you can still be arrested for DUI if you show signs of impairment (like erratic driving or failing a field sobriety test). For teens, the law is even stricter - California has a zero tolerance policy. If you're under 21 and found with a BAC of just 0.01%, you will lose your license for one full year. Many factors affect how quickly your BAC rises and how intoxicated you become: (1) Amount of alcohol consumed - more drinks = higher BAC. Standard drinks contain roughly equal amounts of alcohol: one 12-oz beer (5%), one 5-oz glass of wine (12%), or one 1.5-oz shot of 80-proof liquor. (2) Strength or proof of alcohol - higher ABV (alcohol by volume) or proof means faster intoxication. Proof is twice the ABV (80 proof = 40% ABV). (3) Length of time over which alcohol is consumed - your liver can metabolize about one ounce of alcohol per hour. Drink faster than this and the excess backs up in your system, keeping you intoxicated longer. You can't speed up this process with coffee, cold showers, or exercise. (4) Amount and kind of food in stomach - food slows alcohol absorption. On an empty stomach, alcohol can hit your bloodstream in just 15 minutes. (5) Your weight - body weight matters because of fat vs. muscle content. Muscle has higher water content, so alcohol is absorbed more slowly in people with more muscle mass. (6) Physical and emotional condition - if you're sick, dehydrated, or fatigued, alcohol hits harder and metabolizes slower. Alcohol is a depressant that affects your entire nervous system. About 5% is absorbed by your mouth and throat, the rest by your digestive system. Less than 10% is eliminated by kidneys, lungs, and skin. Your liver handles the other 90% through oxidation. Understanding BAC isn't just about avoiding legal trouble - it's about recognizing that even small amounts of alcohol impair your ability to drive safely, and that for teens, there is NO safe amount of alcohol when driving.",
      "example": "You're 17 at a friend's house party. Someone hands you a Mike's Hard Lemonade. 'It's basically soda,' they say. You drink half of it over 30 minutes, then decide to drive home. Seems fine, right? Wrong. That half drink could easily put you at 0.02% BAC (depending on your weight). You get pulled over for rolling through a stop sign. The officer smells alcohol. You take a preliminary alcohol screening test. Result: 0.02% BAC. That's double California's 0.01% limit for under-21 drivers. Your license? Suspended for one year. Your insurance rates when you get it back? Skyrocketing. All from 'basically soda.' Meanwhile, your friend who had two beers (BAC around 0.05%) is 21, so legally he could drive. But you? Zero tolerance means zero chances.",
      "memoryTip": "BAC limits: Think '8-1-4' → Adults .08, Under-21 .01, Commercial .04. Zero tolerance = Zero drinks for teen drivers! For standard drinks: 'B.W.S.' = Beer 12oz, Wine 5oz, Shots 1.5oz (all equal alcohol). Liver math: 'One per hour' - your liver processes 1oz alcohol/hour. Drink 3 in an hour? You'll be drunk for 3+ hours no matter what you do!",
      "images": [
        "image174.png",
        "image175.png"
      ],
      "estimatedReadTime": 3
    },
    {
      "lessonNumber": 2,
      "title": "How Alcohol Affects Driving",
      "icon": "brain.head.profile",
      "overview": "Alcohol doesn't just make you 'a bit slower' - it fundamentally changes how your brain and body operate, making driving deadly. From impaired judgment to slowed reflexes, here's what actually happens.",
      "keyPoints": [
        "Alcohol impairs judgment - you feel invincible, take risks, misjudge situations",
        "Reduces awareness - you miss hazards, ignore signals, lose peripheral vision",
        "Vision problems - blurry/double vision, poor depth perception, slow pupil response",
        "Slows reaction time - identifying threats, decision-making, and reflexes all delayed",
        "Statistics: 30% of Americans will be in an alcohol-related crash; teens with BAC 0.02-0.05% are 7x more likely to be killed"
      ],
      "detailedContent": "Alcohol affects almost every aspect of driving ability, from how you see the road to how you react to hazards. This isn't about being 'less sharp' - alcohol fundamentally changes how your brain and body operate. (1) JUDGMENT: Alcohol first impairs the part of your brain that makes rational decisions. You might feel invincible or overly confident. You'll underestimate dangers, take unnecessary risks (like speeding or passing unsafely), and misjudge situations. That yellow light? Your impaired brain says 'gun it' instead of 'brake.' (2) AWARENESS: Your ability to concentrate drops dramatically. You'll miss important information like pedestrians stepping off curbs, cars merging, or traffic signals changing. Tasks that require coordination become harder. You might ignore warning signs or struggle to stay in your lane. (3) VISION: Alcohol causes blurred or double vision, making it hard to see clearly. Your depth perception suffers - you can't accurately judge distances between your car and others. Peripheral vision narrows (tunnel vision), so you miss hazards to the sides. Your pupils respond more slowly to changes in light, making night driving especially dangerous. Bright lights become more blinding. (4) REACTION TIME: Everything slows down. Identifying threats takes longer - you might not notice a child running into the street or a car braking ahead. Decision-making becomes sluggish - your brain processes information more slowly. Even if you spot danger and make the right decision, alcohol slows your reflexes so you don't act quickly enough. A delay of even one second can mean the difference between a near-miss and a tragic accident. THE STATISTICS ARE SOBERING: According to the California Highway Patrol, around 30% of Americans will be involved in an alcohol-related traffic collision during their lives. These crashes often result in injury or death. The CDC reports the annual cost of alcohol-related crashes exceeds $44 billion. For teen drivers, alcohol is involved in about 40% of all fatal highway accidents. A young driver with a BAC of just 0.02-0.05% is at least 7 times more likely to be killed than a sober driver. At 0.12% BAC, that risk jumps to 90 times more likely. Teen drivers are 3 times more likely than experienced drivers to crash even when sober - add alcohol and the danger multiplies. Teens show signs of impaired driving at lower BAC levels than adults, meaning what barely affects an adult can significantly hinder a teen's driving. California law recognizes alcohol's dangers. Driving requires concentration, quick decision-making, effective motor skills, and excellent eyesight. Alcohol impairs ALL of these, increasing your risk of a crash exponentially.",
      "example": "You're at a graduation party. You have two drinks over 2 hours. You feel fine - maybe slightly buzzed but totally in control. You decide to drive home. At a four-way stop, you pull out thinking the other car is farther away than it actually is (impaired depth perception). They slam their brakes, barely avoiding you. Your heart races. Two blocks later, the light turns yellow. Normally you'd brake, but your alcohol-impaired judgment says 'I can make it.' You accelerate. The light turns red as you enter the intersection. A car with the green light swerves to avoid you, hitting a parked car. The police arrive. Field sobriety test. You fail. Breathalyzer: 0.06% BAC. You're under 0.08%, but your driving was clearly impaired. You're arrested for DUI. Those two drinks didn't just impair your judgment and vision - they nearly caused a multi-car accident and cost you your license, thousands in legal fees, and your clean record.",
      "memoryTip": "J.A.V.R. = Alcohol ruins 4 key driving skills: Judgment (feel invincible), Awareness (miss hazards), Vision (blurry/tunnel), Reaction time (slooow). Teen danger formula: 'Young + Drunk = Death' - teens 7x more likely to die with BAC .02-.05, and 90x at .12. Remember: Driving needs C.Q.E.M. (Concentration, Quick decisions, Eyesight, Motor skills) - alcohol destroys ALL 4!",
      "images": [
        "image176.png",
        "image177.png"
      ],
      "estimatedReadTime": 3
    },
    {
      "lessonNumber": 3,
      "title": "Drugs & Medications",
      "icon": "pills.fill",
      "overview": "It's not just illegal drugs - prescription meds, over-the-counter cold medicine, even cough syrup can impair your driving and get you arrested for DUI. The law sees no difference.",
      "keyPoints": [
        "California law: NO difference between illegal drugs and legal medications - all can impair driving",
        "OTC dangers: cold medicines (drowsiness), cough syrups (contain alcohol/codeine)",
        "Prescriptions: narcotics (painkillers), depressants (sleeping pills), stimulants (ADHD meds) all impair",
        "Illegal drugs: marijuana (slows reactions), cocaine/meth (paranoia/aggression), heroin (stupor), LSD (hallucinations)",
        "Synergism: combining drugs amplifies effects unpredictably - extremely hazardous"
      ],
      "detailedContent": "California's DUI laws apply to both alcohol AND drugs. It is illegal to drive while under the influence of any drug that affects your ability to drive safely. The law does not see a difference between illegal drugs and medications from a doctor or pharmacy - they can ALL affect your ability to drive safely. OVER-THE-COUNTER (OTC) DRUGS: Many everyday medications impair driving. (1) Cold and allergy medicines contain antihistamines that cause drowsiness, slower response to sudden events, impaired judgment, and reduced concentration. Always read labels for drowsiness warnings. (2) Cough syrups often contain alcohol (which impairs motor skills) or codeine (an opioid that impairs cognitive function). Some contain both, creating a dangerous combination. PRESCRIPTION MEDICATIONS: (1) Narcotics (painkillers like codeine, Demerol) cause drowsiness, poor coordination, and a false sense of well-being. You might feel invincible or overly relaxed, leading to risky behavior or slow responses. (2) Depressants (sleeping pills, tranquilizers, barbiturates) for anxiety, insomnia, or seizures cause uncontrolled drowsiness - you could fall asleep at the wheel. They slow reactions and cause poor coordination. Medical marijuana has similar effects. (3) Stimulants (amphetamines, ADHD medications, diet pills) create a false sense of well-being but lead to lack of concentration, aggressiveness, and impatience. Drivers might tailgate, speed, or make rash decisions. ILLEGAL DRUGS: (1) Marijuana causes drowsiness, distorts perception of time and space, and slows pupil response to light. This leads to slow reaction times and impaired judgment. (2) Narcotics like heroin cause stupor, coma, and even death. They slow reaction time and impair motor skills, severely compromising coordination and focus. (3) Stimulants (cocaine, methamphetamine) cause hyperactivity, extreme agitation, and paranoia. Drivers exhibit reckless behavior like aggressive driving or excessive speeding. Effects include nervousness, convulsions, paranoia, and in extreme cases, heart attacks. (4) Hallucinogens (LSD, PCP, mescaline, peyote) cause visual and auditory hallucinations that interfere with perception of reality. You might see things that aren't there or misinterpret real objects. Some create feelings of super strength or invincibility, causing aggressive behavior. (5) Downers (morphine, fentanyl, sleep aids) slow down the brain, causing listlessness (heavy fatigue where simple tasks seem impossible) and behavioral changes (withdrawn, moody, avoiding activities once loved). SYNERGISM: Combining drugs (even legal ones) intensifies their effects beyond what's expected from individual doses. Mixing substances creates unexpected and intensified reactions that further impair driving. The consequences are unpredictable and extremely hazardous. THE LAW: If a law enforcement officer thinks you're driving under the influence of drugs or alcohol, they can require you to take a blood or urine test. If you refuse, DMV will suspend or revoke your driving privilege for one year. The presence of ANY amount of illegal drugs in your blood can lead to DWI charges. Even prescription drugs taken as directed can lead to DWI if they impaired your driving ability. Always read medication labels, consult pharmacists, and know the effects of any drug you use.",
      "example": "You wake up with a bad cold. You take Nyquil (contains alcohol and an antihistamine). An hour later, you have a dentist appointment. They give you a prescription for Vicodin (a narcotic) for tooth pain. You take one before driving home. You feel fine - just a little drowsy. But you're now on TWO depressants: one OTC, one prescription. At a red light, your eyes close for just a second. When they open, you've rolled into the intersection. An officer pulls you over. Your speech is slurred (you hadn't noticed). Field sobriety test: you can't walk a straight line or follow a pen with your eyes. Blood test reveals: Nyquil's alcohol content + codeine from cough syrup you forgot about + Vicodin. That's synergism - three legal drugs combining to severely impair you. Result: DUI arrest, license suspension, thousands in legal fees, and a criminal record. All from 'just cold medicine and pain meds.'",
      "memoryTip": "U.D.I. drugs = all impair: UpDowners-Illegal (Uppers speed brain = paranoia, Downers slow brain = stupor, Illegal = all types). OTC danger: 'Cold medicine has ALCOHOL!' Prescription D.N.S. = Depressants (sleep), Narcotics (pain), Stimulants (ADHD). For hallucinogens: 'L.S.D. sees things that aren't there!' Synergism = 'Don't MIX = WORSE effects!'",
      "images": [
        "image179.png",
        "image180.png",
        "image181.png",
        "image193.png",
        "image194.png",
        "image195.png"
      ],
      "estimatedReadTime": 3
    },
    {
      "lessonNumber": 4,
      "title": "Consequences & DUI Laws",
      "icon": "gavel.fill",
      "overview": "DUI consequences are SERIOUS: immediate license suspension, jail time, massive fines, criminal record, skyrocketing insurance rates. For teens, one violation can derail your entire future. Here's what you're risking.",
      "keyPoints": [
        "Implied Consent: by driving in CA, you agree to chemical testing if arrested for DUI",
        "Administrative Per Se: immediate 90-day license suspension upon DUI arrest (separate from court)",
        "DUI penalties scale: 1st offense = up to 48hrs jail, 2nd = 96hrs, 3rd = 10 days, 4th = 18 days",
        "Additional consequences: fines, DUI program, SR-22 insurance (expensive!), possible ignition interlock device",
        "Conviction stays on record 10 years; vehicle can be impounded; civil lawsuits if injury/death"
      ],
      "detailedContent": "Driving under the influence is not just dangerous - it's a serious criminal offense with severe penalties. CALIFORNIA'S DUI LAWS: IMPLIED CONSENT (CVC 23612, 13353): California has an implied consent law - just by driving, you agree to take a chemical test if lawfully arrested for suspected DUI. If pulled over and suspected of driving intoxicated, the officer must give you the option of a breathalyzer or blood test. If the officer suspects drug use, they can require an additional test. If you refuse testing, your driving privileges will be revoked - typically for one year. Urine tests are only allowed if both other tests are unavailable, you're a hemophiliac, or you use anticoagulant medication. ADMINISTRATIVE PER SE (ADMIN PER SE): This policy allows immediate suspension of your driver's license for 90 days if found driving intoxicated. This is separate from court proceedings and emphasizes immediate action. When arrested for DUI: (1) Admin Per Se law requires DMV to suspend your privilege, (2) Officer may take your license and give you a temporary 30-day license, (3) You may request a DMV administrative hearing within 10 days of arrest. DUI CONVICTION PENALTIES (CVC 23577): If convicted, penalties depend on your history. For convictions that did NOT result in injury: 1st offense = potentially no additional punishment, but can be jailed up to 48 hours (2 days). 2nd offense = additional 96 hours (4 days) in jail. 3rd offense = additional 10 days in jail. 4th offense = additional 18 days in jail. DUI WITH INJURY (CVC 23153): If your drunk driving injured someone (in your car, another car, or a pedestrian), additional time can be added and may be served in state prison depending on severity. DMV CONSEQUENCES: License suspended or revoked for one year. You must: complete a DUI program, file a California Insurance Proof Certificate (SR 22/SR 1P - very expensive), pay license reissue/restriction fees, possibly install an ignition interlock device (IID) on your vehicle. ADDITIONAL PENALTIES: You may be sentenced to up to 6 months in jail. You may pay substantial fines. Law enforcement may impound your vehicle (you pay storage fees). If you cause serious injury or death, you face civil lawsuits. All DUI convictions remain on your driver's record for 10 years - any additional DUIs during that time result in harsher penalties. UNDER 21 CONSEQUENCES (CVC 13353.3, DMV Handbook pg 75): If under 21 and convicted of DUI with BAC 0.01% or higher, DMV may revoke your driving privilege for one year. You must complete a licensed DUI program. If caught with alcohol in your vehicle: law enforcement can impound your vehicle for up to 30 days, court may fine you and suspend your license for one year, or delay your first license for up to one year. IMPORTANT NOTE: If you're 13-20 years old and convicted of operating a BICYCLE while under the influence, your driving privilege may be suspended or delayed for one year once eligible to drive. RECKLESS DRIVING (CVC 23103): Deliberate disregard for safety = 5-90 days jail and/or $145-$1,000 fine. POSSESSION/USE IN VEHICLE: It's illegal to drink alcohol or smoke/eat cannabis while driving or riding as a passenger. Containers must be sealed and unopened. If open, must be in trunk or where passengers don't sit. Cannot keep open container in glove box (except in bus, taxi, camper, motorhome). These laws exist to deter dangerous choices and reduce unnecessary loss of life. The financial, legal, and personal consequences are severe and long-lasting.",
      "example": "You're 17, got your license 6 months ago. Friday night, friend's party. You have two beers. Feel fine. Decide to drive home. Get pulled over for weaving. Officer smells alcohol. Preliminary test: BAC 0.03%. That's 3x the 0.01% limit for under-21. You're arrested. Here's what happens: (1) IMMEDIATE: Officer takes your license, gives you a 30-day temporary one. Car impounded (your dad pays $500 to get it out). (2) DMV ADMIN: License automatically suspended for one year under Admin Per Se. (3) CRIMINAL COURT: You're convicted of DUI. Must complete DUI program ($500+), pay fines ($2,000+), get SR-22 insurance (adds $1,000/year). (4) LONG-TERM: DUI on your record for 10 years. College applications ask about criminal convictions. Job applications too. You wanted to be a commercial pilot? Most airlines won't hire you with a DUI. Insurance rates stay high for years. Total cost: $5,000-$10,000 minimum. Plus: no license for a year as a teen = no independence, no job, no social life. All from two beers. Was it worth it?",
      "memoryTip": "DUI penalties: '2-4-10-18' (jail days: 1st=2, 2nd=4, 3rd=10, 4th=18). I.C.A. = what happens: Implied consent test required, Conviction consequences serious, Admin Per Se = 90-day immediate suspension. Under 21: 'Zero.01 = license GONE 1 year!' Remember: S.F.I.P. costs = Suspension, Fines, Insurance (SR-22), Program (DUI class). Conviction = Criminal record for 10 YEARS!",
      "images": [
        "image178.png",
        "image190.png",
        "image191.png",
        "image197.png"
      ],
      "estimatedReadTime": 3
    }
  ]
}